load_test/load_report.txt
Running 20s test @ http://localhost:9080
  6 threads and 12 connections
  Thread calibration: mean lat.: 5.113ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 4.800ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 5.763ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 5.584ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 5.887ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 5.805ms, rate sampling interval: 22ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency      nanus     nanus   0.00us    0.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.00us
 75.000%    0.00us
 90.000%    0.00us
 99.000%    0.00us
 99.900%    0.00us
 99.990%    0.00us
 99.999%    0.00us
100.000%    0.00us

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.000     1.000000            0          inf
#[Mean    =          nan, StdDeviation   =          nan]
#[Max     =        0.000, Total count    =            0]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4437 requests in 20.01s, 801.12KB read
  Socket errors: connect 0, read 0, write 0, timeout 60
Requests/sec:    221.71
Transfer/sec:     40.03KB